import React, {useLayoutEffect} from "react";
import Carousel from "./Carousel";

function AboutCompany() {

    useLayoutEffect(() => {
        window.scrollTo(0, 0)
    });

    return(
        <div>
            <div style={{padding: 0 + 5 + "%" + 10 + "%" + 0}}>
                <p>My Pizza — мережа піцерій, яка швидко розвивається, і пишається тим, що пропонує винятковий кулінарний досвід завдяки ідеальному поєднанню традицій та інновацій. Заснована в 2010 році, компанія My Pizza швидко стала улюбленою серед любителів піци завдяки своїй відданості використанню лише найсвіжіших інгредієнтів і ретельному виготовленню кожної піци.</p>
        
                <p>У My Pizza філософія проста: чудова піца починається з чудових інгредієнтів. Тісто щодня готується свіже, розтягується вручну, щоб досягти ідеального балансу м’якості та хрусткості. Соус, ретельно охоронюваний сімейний рецепт, готується з визрілих помідорів і унікальної суміші трав і спецій. Начинки варіюються від класичних пепероні та моцарели до більш авантюрних варіантів, таких як трюфельна олія та рукола, що задовольняють широкий спектр смаків.</p>
                
                <p>Атмосфера My Pizza тепла та затишна, створена для того, щоб гості відчували себе як вдома. Якщо ви обідаєте з родиною та друзями, збираєте швидкий обід або замовляєте доставку для затишної ночі, у центрі уваги завжди є надання чудового обслуговування та незабутні враження від обіду.</p>
                
                <p>В основі успіху My Pizza лежить інновація. Компанія постійно досліджує нові поєднання смаків і технології приготування, гарантуючи, що в меню завжди буде щось захоплююче. Сезонні спеціальні пропозиції та тимчасові пропозиції змушують клієнтів повертатися, щоб побачити новинки.</p>
                
                <p>Сталий розвиток і спільнота також є ключовими компонентами місії My Pizza. Компанія постачає інгредієнти на місці, коли це можливо, підтримує місцевих фермерів і бере участь у різноманітних програмах по роботі з громадою. Ця відданість відповідальним практикам принесла My Pizza лояльних прихильників і репутацію компанії, яка дбає не лише про прибуток.</p>
                
                <p>З його смачними пропозиціями, дружньою атмосферою та відданістю якості та спільноті My Pizza – це не просто місце, де можна поїсти, це місце, де можна залишити незабутні спогади.</p>
            </div>
            <Carousel minWidth={1062} minHeight={522} images={["/imgAboutCompany/baner1.png", "/imgAboutCompany/baner2.png", "/imgAboutCompany/baner3.png"]} dots={false} autoScroll={false}></Carousel>
        </div>
    )
}

export default AboutCompany;